<template>
  <div class="disease">
    <tree-info :treeData="treeData" :treeItemData="treeItemData"></tree-info>
    <table-info :breadcrumbList="breadcrumbList" :tableData="tableData"></table-info>
  </div>
</template>

<script>
import TableInfo from './components/DiseaseTable'
import TreeInfo from './components/DiseaseTree'
export default {
  name: 'disease',
  components: { TableInfo, TreeInfo },
  data () {
    return {
      breadcrumbList: ['疾病', '内科'],
      tableData: [],
      treeData: [
        {
          name: 'jb',
          title: '西医疾病',
          icon: ''
        }, {
          name: 'zyjb',
          title: '中医疾病',
          icon: ''
        }, {
          name: 'zyzh',
          title: '中医症候',
          icon: ''
        }, {
          name: 'ss',
          title: '手术',
          icon: ''
        }, {
          name: 'zl',
          title: '肿瘤形态学',
          icon: ''
        }
      ],
      treeItemData: ['内科', '外科', '皮肤科', '心内科', '血液科', '肿瘤科', '儿童科', '康复科', '妇产科', '中医科', '感染科', '呼吸科']
    }
  },
  created () {
    for (var i = 0; i < 100; i++) {
      this.tableData.push({
        id: i,
        type: '疾病' + i,
        sort: '内科',
        num: '13132131',
        name: '感冒发烧流鼻涕' + i,
        detail: '感冒发烧流鼻涕感冒发烧流鼻涕',
        detailInfo: '<p>肺炎球菌肺炎（ pneumococcaI pneumonia ）是由肺炎球菌或称肺炎链球菌（ streptoccus pneumoniae ）引起的肺叶或肺段的肺实质的炎症，是 CAP 最常见的致病原，通常占 30 ％~ 70％。’该菌所致的肺炎即传统上称的大叶性肺炎。但由于近年来抗生素及时和广泛应用，典型的整叶、整段肺实变已较少见。本病尚有一定传染性。</p><strong>病因收起参《呼吸疾病诊疗指南-第3版-赵建平-科学出版社》 第95页</strong><p>1 ．本菌属革兰阳性菌，α溶血，菌体呈矛头状或双排列，外有荚膜包绕。至今已确认的有 84 种荚膜型亚型。引起成人致病的大多数为 1 - 9 型和 12 型，其中 3 型毒力最强。不产生毒素，不引起原发组织坏死和形成空洞，易累及胸膜，引起渗出性胸膜炎。</p><p>2 ．本菌可寄居于人的上呼吸道。</p><p>3 ．本菌是引起大叶性肺炎的主要致病菌，亦可引起中耳炎、乳突炎、脑膜炎及败血症等。 </p><strong>病因收起参《呼吸疾病诊疗指南-第3版-赵建平-科学出版社》 第95页</strong><p>1 ．本菌属革兰阳性菌，α溶血，菌体呈矛头状或双排列，外有荚膜包绕。至今已确认的有 84 种荚膜型亚型。引起成人致病的大多数为 1 - 9 型和 12 型，其中 3 型毒力最强。不产生毒素，不引起原发组织坏死和形成空洞，易累及胸膜，引起渗出性胸膜炎。</p><p>2 ．本菌可寄居于人的上呼吸道。</p><p>3 ．本菌是引起大叶性肺炎的主要致病菌，亦可引起中耳炎、乳突炎、脑膜炎及败血症等。</p><p>肺炎球菌肺炎（ pneumococcaI pneumonia ）是由肺炎球菌或称肺炎链球菌（ streptoccus pneumoniae ）引起的肺叶或肺段的肺实质的炎症，是 CAP 最常见的致病原，通常占 30 ％~ 70％。’该菌所致的肺炎即传统上称的大叶性肺炎。但由于近年来抗生素及时和广泛应用，典型的整叶、整段肺实变已较少见。本病尚有一定传染性。</p><strong>病因收起参《呼吸疾病诊疗指南-第3版-赵建平-科学出版社》 第95页</strong><p>1 ．本菌属革兰阳性菌，α溶血，菌体呈矛头状或双排列，外有荚膜包绕。至今已确认的有 84 种荚膜型亚型。引起成人致病的大多数为 1 - 9 型和 12 型，其中 3 型毒力最强。不产生毒素，不引起原发组织坏死和形成空洞，易累及胸膜，引起渗出性胸膜炎。</p><p>2 ．本菌可寄居于人的上呼吸道。</p><p>3 ．本菌是引起大叶性肺炎的主要致病菌，亦可引起中耳炎、乳突炎、脑膜炎及败血症等。 </p><strong>病因收起参《呼吸疾病诊疗指南-第3版-赵建平-科学出版社》 第95页</strong><p>1 ．本菌属革兰阳性菌，α溶血，菌体呈矛头状或双排列，外有荚膜包绕。至今已确认的有 84 种荚膜型亚型。引起成人致病的大多数为 1 - 9 型和 12 型，其中 3 型毒力最强。不产生毒素，不引起原发组织坏死和形成空洞，易累及胸膜，引起渗出性胸膜炎。</p><p>2 ．本菌可寄居于人的上呼吸道。</p><p>3 ．本菌是引起大叶性肺炎的主要致病菌，亦可引起中耳炎、乳突炎、脑膜炎及败血症等。</p><p>肺炎球菌肺炎（ pneumococcaI pneumonia ）是由肺炎球菌或称肺炎链球菌（ streptoccus pneumoniae ）引起的肺叶或肺段的肺实质的炎症，是 CAP 最常见的致病原，通常占 30 ％~ 70％。’该菌所致的肺炎即传统上称的大叶性肺炎。但由于近年来抗生素及时和广泛应用，典型的整叶、整段肺实变已较少见。本病尚有一定传染性。</p><strong>病因收起参《呼吸疾病诊疗指南-第3版-赵建平-科学出版社》 第95页</strong><p>1 ．本菌属革兰阳性菌，α溶血，菌体呈矛头状或双排列，外有荚膜包绕。至今已确认的有 84 种荚膜型亚型。引起成人致病的大多数为 1 - 9 型和 12 型，其中 3 型毒力最强。不产生毒素，不引起原发组织坏死和形成空洞，易累及胸膜，引起渗出性胸膜炎。</p><p>2 ．本菌可寄居于人的上呼吸道。</p><p>3 ．本菌是引起大叶性肺炎的主要致病菌，亦可引起中耳炎、乳突炎、脑膜炎及败血症等。 </p><strong>病因收起参《呼吸疾病诊疗指南-第3版-赵建平-科学出版社》 第95页</strong><p>1 ．本菌属革兰阳性菌，α溶血，菌体呈矛头状或双排列，外有荚膜包绕。至今已确认的有 84 种荚膜型亚型。引起成人致病的大多数为 1 - 9 型和 12 型，其中 3 型毒力最强。不产生毒素，不引起原发组织坏死和形成空洞，易累及胸膜，引起渗出性胸膜炎。</p><p>2 ．本菌可寄居于人的上呼吸道。</p><p>3 ．本菌是引起大叶性肺炎的主要致病菌，亦可引起中耳炎、乳突炎、脑膜炎及败血症等。</p><p>肺炎球菌肺炎（ pneumococcaI pneumonia ）是由肺炎球菌或称肺炎链球菌（ streptoccus pneumoniae ）引起的肺叶或肺段的肺实质的炎症，是 CAP 最常见的致病原，通常占 30 ％~ 70％。’该菌所致的肺炎即传统上称的大叶性肺炎。但由于近年来抗生素及时和广泛应用，典型的整叶、整段肺实变已较少见。本病尚有一定传染性。</p><strong>病因收起参《呼吸疾病诊疗指南-第3版-赵建平-科学出版社》 第95页</strong><p>1 ．本菌属革兰阳性菌，α溶血，菌体呈矛头状或双排列，外有荚膜包绕。至今已确认的有 84 种荚膜型亚型。引起成人致病的大多数为 1 - 9 型和 12 型，其中 3 型毒力最强。不产生毒素，不引起原发组织坏死和形成空洞，易累及胸膜，引起渗出性胸膜炎。</p><p>2 ．本菌可寄居于人的上呼吸道。</p><p>3 ．本菌是引起大叶性肺炎的主要致病菌，亦可引起中耳炎、乳突炎、脑膜炎及败血症等。 </p><strong>病因收起参《呼吸疾病诊疗指南-第3版-赵建平-科学出版社》 第95页</strong><p>1 ．本菌属革兰阳性菌，α溶血，菌体呈矛头状或双排列，外有荚膜包绕。至今已确认的有 84 种荚膜型亚型。引起成人致病的大多数为 1 - 9 型和 12 型，其中 3 型毒力最强。不产生毒素，不引起原发组织坏死和形成空洞，易累及胸膜，引起渗出性胸膜炎。</p><p>2 ．本菌可寄居于人的上呼吸道。</p><p>3 ．本菌是引起大叶性肺炎的主要致病菌，亦可引起中耳炎、乳突炎、脑膜炎及败血症等。</p>'
      })
    }
  },
  methods: {
    setBreadcrumbList (list) {
      this.breadcrumbList = list
    }
  }
}
</script>

<style scoped lang="scss">
.disease {
  display: flex;
  width: 100%;
  height: 100%;
  // background-color: #f0f3f8;
}
</style>